org/imu.org
#+DATE: <2020-11-15 Sun 13:59>
#+TITLE: IMU

** 序言

道为何用？解惑者也！当我们心存疑惑，不知所已的时候，就会问道。

问道何处？心也！心者，感受之源，似平原走马，易放难收。

何为惑？或心，为选乃择，是谓不定，不定乃困。困则生疑，疑则闭，闭则自封。固步者惘，惘乃求，求则明，明知本心。面壁者求破壁，自缚者欲破茧，亦不失为一种浪漫。

** 哲学

*哲学是什么？* 哲学是一种系统的世界观和方法论，其基本问题是 _思维和存在_ 的关系。

*何为世界观？* 就是“世界的本质是什么”，我们是以什么样的方式看待世界的。 *何为方法论？* 就是“认识世界、改造世界的方法”。

*思维和存在有什么关系呢？*

#+BEGIN_EXPORT html
<note>
思维和存在，意识和物质，精神和自然，异名同谓。
</note>
#+END_EXPORT

第一性和同一性。所谓“第一性”，即思维和存在（意识和物质）谁是世界的本源，是意识决定物质，还是物质决定意识。所谓“同一性”，是指意识能否正确地认识物质。

根据对“第一性”理解的不同，哲学可以分为 _唯物主义_ 和 _唯心主义_ ；根据对“同一性”理解的不同，其方法论可以分为 _可知论_ 和 _不可知论_ 。

下面我们就分小节简要说明以下这几个方面。

*** 唯物主义

唯物主义，认为物质是世界的本源，即物质决定意识。

如何理解呢？...

*** 唯心主义

唯心主义，认为意识是世界的本源，即意识决定物质。

如何理解呢？通俗点来说，就是笛卡尔的“我思故我在”了。也就是说，除你之外的万物不过是你的“念”，山川、河流，飘香、清风，都是“念”。

