public/imu.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-01 Fri 12:32 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>IMU</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" type="text/css" href="/dist/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">IMU</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga54946a">序言</a></li>
<li><a href="#org8d12e0b">哲学</a>
<ul>
<li><a href="#org8c0eb33">唯物主义</a></li>
<li><a href="#org78c2a45">唯心主义</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga54946a" class="outline-2">
<h2 id="orga54946a">序言</h2>
<div class="outline-text-2" id="text-orga54946a">
<p>
道为何用？解惑者也！当我们心存疑惑，不知所已的时候，就会问道。
</p>

<p>
问道何处？心也！心者，感受之源，似平原走马，易放难收。
</p>

<p>
何为惑？或心，为选乃择，是谓不定，不定乃困。困则生疑，疑则闭，闭则自封。固步者惘，惘乃求，求则明，明知本心。面壁者求破壁，自缚者欲破茧，亦不失为一种浪漫。
</p>
</div>
</div>

<div id="outline-container-org8d12e0b" class="outline-2">
<h2 id="org8d12e0b">哲学</h2>
<div class="outline-text-2" id="text-org8d12e0b">
<p>
<b>哲学是什么？</b> 哲学是一种系统的世界观和方法论，其基本问题是 <span class="underline">思维和存在</span> 的关系。
</p>

<p>
<b>何为世界观？</b> 就是“世界的本质是什么”，我们是以什么样的方式看待世界的。 <b>何为方法论？</b> 就是“认识世界、改造世界的方法”。
</p>

<p>
<b>思维和存在有什么关系呢？</b>
</p>

<note>
思维和存在，意识和物质，精神和自然，异名同谓。
</note>

<p>
第一性和同一性。所谓“第一性”，即思维和存在（意识和物质）谁是世界的本源，是意识决定物质，还是物质决定意识。所谓“同一性”，是指意识能否正确地认识物质。
</p>

<p>
根据对“第一性”理解的不同，哲学可以分为 <span class="underline">唯物主义</span> 和 <span class="underline">唯心主义</span> ；根据对“同一性”理解的不同，其方法论可以分为 <span class="underline">可知论</span> 和 <span class="underline">不可知论</span> 。
</p>

<p>
下面我们就分小节简要说明以下这几个方面。
</p>
</div>

<div id="outline-container-org8c0eb33" class="outline-3">
<h3 id="org8c0eb33">唯物主义</h3>
<div class="outline-text-3" id="text-org8c0eb33">
<p>
唯物主义，认为物质是世界的本源，即物质决定意识。
</p>

<p>
如何理解呢？&#x2026;
</p>
</div>
</div>

<div id="outline-container-org78c2a45" class="outline-3">
<h3 id="org78c2a45">唯心主义</h3>
<div class="outline-text-3" id="text-org78c2a45">
<p>
唯心主义，认为意识是世界的本源，即意识决定物质。
</p>

<p>
如何理解呢？通俗点来说，就是笛卡尔的“我思故我在”了。也就是说，除你之外的万物不过是你的“念”，山川、河流，飘香、清风，都是“念”。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-11-15 Sun 13:59</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2021-01-01 Fri 12:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
